{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2048], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "dense_18"}], "input_layers": [["input_18", 0, 0]], "output_layers": [["dense_18", 0, 0]], "name": "model_18"}, "backend": "tensorflow"}