{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 7, 7, 2048], "name": "input1", "sparse": false}, "inbound_nodes": [], "name": "input1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 30, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["input1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [7, 7], "padding": "valid", "strides": [7, 7]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "average_pooling2d_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4096], "name": "input2", "sparse": false}, "inbound_nodes": [], "name": "input2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "flatten_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["flatten_8", 0, 0, {}], ["dense_3", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dense_4"}], "input_layers": [["input1", 0, 0], ["input2", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}